In [91]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn import linear_model
import warnings
warnings.filterwarnings('ignore')

In [92]:
df=pd.read_csv(r'C:\Users\Gaurav\Downloads\houses_to_rent.csv')

In [93]:
df.head()

   area  rooms  bathroom  parking spaces floor rent amount
0   240      3         3               4     -     R$8,000
1    64      2         1               1    10       R$820
2   443      5         5               4     3     R$7,000
3    73      2         2               1    12     R$1,250
4    19      1         1               0     -     R$1,200

In [94]:
df.isnull().sum()

area              0
rooms             0
bathroom          0
parking spaces    0
floor             0
rent amount       0
dtype: int64

In [95]:
df['floor'].replace('-','0',inplace=True) #replaced '-' with 0

In [96]:
df.head()

   area  rooms  bathroom  parking spaces floor rent amount
0   240      3         3               4     0     R$8,000
1    64      2         1               1    10       R$820
2   443      5         5               4     3     R$7,000
3    73      2         2               1    12     R$1,250
4    19      1         1               0     0     R$1,200

In [97]:
df=df.rename(columns={'rent amount':'rentamount'})
df=df.rename(columns={'parking spaces':'parkingsapaces'})

In [98]:
df.head()

   area  rooms  bathroom  parkingsapaces floor rentamount
0   240      3         3               4     0    R$8,000
1    64      2         1               1    10      R$820
2   443      5         5               4     3    R$7,000
3    73      2         2               1    12    R$1,250
4    19      1         1               0     0    R$1,200

In [99]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6080 entries, 0 to 6079
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   area            6080 non-null   int64
 1   rooms           6080 non-null   int64
 2   bathroom        6080 non-null   int64
 3   parkingsapaces  6080 non-null   int64
 4   floor           6080 non-null   object
 5   rentamount      6080 non-null   object
dtypes: int64(4), object(2)
memory usage: 285.1+ KB

In [100]:
for coulumns in df:
    df['rentamount']=df['rentamount'].str.replace(r'\W',"")
    df['rentamount']=df['rentamount'].str.replace('R',"")

In [101]:
df

      area  rooms  bathroom  parkingsapaces floor rentamount
0      240      3         3               4     0       8000
1       64      2         1               1    10        820
2      443      5         5               4     3       7000
3       73      2         2               1    12       1250
4       19      1         1               0     0       1200
...    ...    ...       ...             ...   ...        ...
6075    50      2         1               1     2       1150
6076    84      2         2               1    16       2900
6077    48      1         1               0    13        950
6078   160      3         2               2     0       3500
6079    60      2         1               1     4       1900

[6080 rows x 6 columns]

In [102]:
df['rentamount']=df.rentamount.astype(int)
df['floor']=df.floor.astype(int)

In [103]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6080 entries, 0 to 6079
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   area            6080 non-null   int64
 1   rooms           6080 non-null   int64
 2   bathroom        6080 non-null   int64
 3   parkingsapaces  6080 non-null   int64
 4   floor           6080 non-null   int32
 5   rentamount      6080 non-null   int32
dtypes: int32(2), int64(4)
memory usage: 237.6 KB

In [107]:
reg=linear_model.LinearRegression()
reg.fit(df[['area','rooms','bathroom','parkingsapaces','floor']],df.rentamount)

LinearRegression()

In [111]:
reg.predict([[1500,7,2,2,10]])

array([5714.65547231])

In [113]:
reg.coef_

array([4.20196323e-01, 1.67457484e+02, 1.10720170e+03, 5.12328249e+02,
       5.79005604e+01])

In [114]:
reg.intercept_

94.09309547846533

In [115]:
2+4.20196323e-01*1500+1.67457484e+02 *7+1.10720170e+03*2+5.12328249e+02*2+5.79005604e+01*10+94.09309547846533

5716.655469978466